{"Name":".NET","Posts":[{"Title":"Blazor Web Apps in ASP.NET Core 8","Subtitle":null,"Slug":"blazor-web-apps-in-aspnet-core-8","Author":null,"Image":null,"Published":"2023-09-02T00:00:00","EstimatedReadTime":"00:07:09.6000000","Excerpt":"\u003Cp\u003ESome big exciting stuff is coming to Blazor on the server in ASP.NET Core 8.\u003C/p\u003E\n\u003Cp\u003E\u003Cem\u003EThe article was updated on November 12, 2023 - Reflecting the changes to render modes\u003C/em\u003E\u003C/p\u003E\n\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EIn the beginning of time, Web development used to be about the web server receiving a request from a client browser, generating some HTML, and returning it with the response. The result was a static non-interactive page that the browser rendered on screen.\u003C/p\u003E\n\u003Cp\u003EThen JavaScript came along,...","Tags":["Blazor",".NET","ASP.NET Core","Web development"]},{"Title":"C# features that Java doesn\u0027t have","Subtitle":null,"Slug":"csharp-features-java-doesnt-have","Author":null,"Image":null,"Published":"2023-04-14T00:00:00","EstimatedReadTime":"00:23:07.6363636","Excerpt":"\u003Cp\u003EIn this article I list some of the major features in C# and .NET that have no direct equivalent in Java. Some of the features are just mentioned because they are so essential and cool.\u003C/p\u003E\n\u003Cp\u003EI explain how stuff works and also demonstrate some in C# code.\u003C/p\u003E\n\u003Cp\u003EMy goal has been to show some C# specific syntax without highlighting it, like expression-bodied methods and alternative syntax for initializing objects. You will also notice my alternating use of \u003Ccode\u003Evar\u003C/code\u003E for type...","Tags":[".NET","C#"]},{"Title":"Project Highlight: Access Control","Subtitle":null,"Slug":"access-control","Author":null,"Image":"/assets/accesscontrol.jpg","Published":"2021-11-16T00:00:00","EstimatedReadTime":"00:02:53.8909090","Excerpt":"\u003Cp\u003EThis is a short presentation about one of my dearest personal projects. The projects combines my passion for programming with my interest in software design - and my desire to learn.\u003C/p\u003E\n\u003Cp\u003EMy main goal in this project was to learn more about building distributed applications - with some IoT. I also wanted to learn more about Microsoft Azure.\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EBack in 2017, I was looking for some fun project to do in my spare time - but I needed a cool use case.\u003C/p\u003E\n\u003Cp\u003ESince I was working as a...","Tags":["Projects",".NET","Web","Distributed applications"]},{"Title":"Introduction to .NET","Subtitle":null,"Slug":"introduction-to-dotnet","Author":"Marina Sundström","Image":null,"Published":"2021-04-25T00:00:00","EstimatedReadTime":"00:04:22.6909090","Excerpt":"\u003Cp\u003E.NET is an open-source platform for building applications for the Web, Mobile, Desktop, and Cloud. Currently, it is at version 5, which was released in November 2020.\u003C/p\u003E\n\u003Cp\u003E.NET provides a runtime environment, the Common Language Runtime (CLR), an extensive base Base Class Library (BCL), programming languages like C#, VB.NET, and F#. On top of the platform you find many application frameworks, such as ASP.NET Core and WPF. It also integrates well with Microsoft Azure.\u003C/p\u003E\n\u003Cp\u003EThe platform...","Tags":[".NET","C#"]},{"Title":"JavaScript interop in .NET on WebAssembly","Subtitle":null,"Slug":"js-interop-in-dotnet-wasm","Author":null,"Image":null,"Published":"2019-10-20T00:00:00","EstimatedReadTime":"00:05:47.5636363","Excerpt":"\u003Cblockquote\u003E\n\u003Cp\u003EThis article was written back in 2019-06-15.\u003C/p\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003EThis article is about JavaScript interop in .NET on WebAssembly in the context of Blazor.\u003C/p\u003E\n\u003Cp\u003ESince WASM development, at least, is about the web we will assume that we can do some interop with the browser, like DOM manipulation. But how?\u003C/p\u003E\n\u003Ch2\u003EJavaScript interop in Blazor\u003C/h2\u003E\n\u003Cp\u003EIf you want to interop with JavaScript today, you are most likely writing a Blazor app.\u003C/p\u003E\n\u003Cp\u003EIn fact, Blazor on client-side...","Tags":[".NET","WebAssembly","WASM","JavaScript","Blazor"]}],"Page":2,"TotalPages":3}