[{"Title":"Project Highlight: Access Control","Slug":"access-control","Author":null,"Image":"/assets/accesscontrol.jpg","Published":"2021-11-16T00:00:00","Excerpt":"\u003Cp\u003EThis is a short presentation about one of my dearest personal projects. The projects combines my passion for programming with my interest in software design - and my desire to learn.\u003C/p\u003E\n\u003Cp\u003EMy main goal in this project was to learn more about building distributed applications - with some IoT. I also wanted to learn more about Microsoft Azure.\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EBack in 2017, I was looking for some fun project to do in my spare time - but I needed a cool use case.\u003C/p\u003E\n\u003Cp\u003ESince I was working as a...","Tags":["Projects",".NET","Web","Distributed applications"]},{"Title":"My work experiences","Slug":"my-work-experiences","Author":"Marina Sundström\u0022","Image":null,"Published":"2021-11-14T00:00:00","Excerpt":"\u003Cp\u003EIn job interviews, I often get asked about my experience in each place that I have been. I am uncomfortable answering since it always feels like I’m missing something, and that too much emphasis is set to be put on the wrong things.\u003C/p\u003E\n\u003Cp\u003EI have written this short summary to talk about my experiences in a, hopefully, more balanced way.\u003C/p\u003E\n\u003Ch2\u003ETeleservice\u003C/h2\u003E\n\u003Cp\u003EMy career started in 2014, when I got an internship at Teleservice Skåne AB, a family-owned company in the middle of rural Skåne,...","Tags":["Work","Experience","Personal"]},{"Title":"How does it compute? - The Human Computer","Slug":"how-does-it-compute","Author":"Marina Sundström\u0022","Image":null,"Published":"2021-11-10T00:00:00","Excerpt":"\u003Cp\u003E\u003Cem\u003EThe idea of this article came about this summer, after having a conversation about computers with a car mechanic. This how I would have explained how a computer operates to him.\u003C/em\u003E\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EIn this exercise, you will play the part of a human computer.\u003C/p\u003E\n\u003Cp\u003EThe goal is for you to learn how a computer interprets and executes instructions, using real-world analogies, and an imaginary machine language.\u003C/p\u003E\n\u003Ch2\u003EThe Memory\u003C/h2\u003E\n\u003Cp\u003EImagine a piece of tape that is divided into equal...","Tags":["Computing","Computer science","Programming"]},{"Title":"Scaling a Monolith - without Microservices","Slug":"scaling-a-monolith-without-microservices","Author":null,"Image":null,"Published":"2021-09-06T00:00:00","Excerpt":"\u003Cp\u003EOne myth is that you need to \u0026quot;do\u0026quot; microservices in order to scale your service applications horizontally. This has prompted a lot of people to rewrite their existing monoliths into microservices.\u003C/p\u003E\n\u003Cp\u003EDon\u0027t get me wrong. There are benefits in microservices, but you need to understand the problems that the tools address before you start to use them - especially in an existing project. The cost of changing existing code might outrun the potential benefits in terms of the technical...","Tags":["Software engineering","Distributed applications"]},{"Title":"Docker and Kubernetes - An Introduction","Slug":"docker-and-kubernetes-an-introduction","Author":null,"Image":"/assets/container-ship.jpeg","Published":"2021-09-01T00:00:00","Excerpt":"\u003Cp\u003E\u003Cem\u003EUpdated on September 20th, 2021.\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003EThere are two pieces of software that everybody is talking about right now: Docker and Kubernetes.\u003C/p\u003E\n\u003Ch2\u003EDocker\u003C/h2\u003E\n\u003Cp\u003EDocker is a virtualization software that lets you build composable software parts, called \u0026quot;images\u0026quot;, that then run in isolated compartments: \u0026quot;containers\u0026quot;.\u003C/p\u003E\n\u003Cp\u003EImagine wanting a Web Server. Instead of manually installing and configuring Nginx (\u0026quot;Engine-X\u0026quot;) in a Virtual Machine, you just tell...","Tags":["Docker","Kubernetes","DevOps","Distributed applications"]},{"Title":"Microservices - What are they?","Slug":"microservices-what-are-they","Author":null,"Image":null,"Published":"2021-09-01T00:00:00","Excerpt":"\u003Cp\u003EMicroservices is a hot topic in software development nowadays. Everybody wants to do it, but what is the point of it?\u003C/p\u003E\n\u003Cp\u003EAnd the most important question: How small should a micro service really be?\u003C/p\u003E\n\u003Ch2\u003EWhat are Microservices?\u003C/h2\u003E\n\u003Cp\u003EMicroservices are a response to building traditional monolithic Service-oriented applications (SOA) - addressing the problems in scalability and fault tolerance in distributed software systems.\u003C/p\u003E\n\u003Cp\u003EIt used to be that developers built services that had...","Tags":["Microservices","Distributed applications"]},{"Title":"Introduction to .NET","Slug":"introduction-to-dotnet","Author":"Marina Sundström","Image":null,"Published":"2021-04-25T00:00:00","Excerpt":"\u003Cp\u003E.NET is an open-source platform for building applications for the Web, Mobile, Desktop, and Cloud. Currently, it is at version 5, which was released in November 2020.\u003C/p\u003E\n\u003Cp\u003E.NET provides a runtime environment, the Common Language Runtime (CLR), an extensive base Base Class Library (BCL), programming languages like C#, VB.NET, and F#. On top of the platform you find many application frameworks, such as ASP.NET Core and WPF. It also integrates well with Microsoft Azure.\u003C/p\u003E\n\u003Cp\u003EThe platform...","Tags":[".NET","C#"]},{"Title":"JavaScript interop in .NET on WebAssembly","Slug":"js-interop-in-dotnet-wasm","Author":null,"Image":null,"Published":"2019-10-20T00:00:00","Excerpt":"\u003Cblockquote\u003E\n\u003Cp\u003EThis article was written back in 2019-06-15.\u003C/p\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003EThis article is about JavaScript interop in .NET on WebAssembly in the context of Blazor.\u003C/p\u003E\n\u003Cp\u003ESince WASM development, at least, is about the web we will assume that we can do some interop with the browser, like DOM manipulation. But how?\u003C/p\u003E\n\u003Ch2\u003EJavaScript interop in Blazor\u003C/h2\u003E\n\u003Cp\u003EIf you want to interop with JavaScript today, you are most likely writing a Blazor app.\u003C/p\u003E\n\u003Cp\u003EIn fact, Blazor on client-side...","Tags":[".NET","WebAssembly","WASM","JavaScript","Blazor"]},{"Title":"Introduction to Blazor","Slug":"introduction-to-blazor","Author":null,"Image":null,"Published":"2019-05-30T00:00:00","Excerpt":"\u003Cp\u003EThis is an introductory article on Blazor.\u003C/p\u003E\n\u003Cp\u003ESimply put: Blazor is a framework for client-side .NET web development.\u003C/p\u003E\n\u003Cimg src=\u0022https://github.com/robertsundstrom/blog/blob/master/assets/blazor_brand.png?raw=true\u0022 alt=\u0022Blazor Brand\u0022 width=\u0022150\u0022/\u003E\n\u003Ch2\u003EHistory\u003C/h2\u003E\n\u003Cp\u003EAt NDC Oslo back in 2017, Steve Sanderson, of Microsoft, held a presentation titled \u003Ca href=\u0022https://www.youtube.com/watch?v=MiLAE6HMr10\u0026amp;feature=youtu.be\u0026amp;t=31m45s\u0022\u003E\u0026quot;Web Apps can’t really do \u003Cem\u003Ethat\u003C/em\u003E, can...","Tags":["Blazor",".NET","Web","WebAssembly"]},{"Title":"Explaining WebAssembly","Slug":"explaining-webassembly","Author":null,"Image":null,"Published":"2019-05-25T00:00:00","Excerpt":"\u003Cp\u003EThere has been a lot of talk about WebAssembly lately. But what is it really?\u003C/p\u003E\n\u003Cp\u003EIn this article we will have a look at the technology and the benefits it brings for developers.\u003C/p\u003E\n\u003Cimg src=\u0022https://github.com/robertsundstrom/blog/blob/master/assets/wasm_logo.png?raw=true\u0022 alt=\u0022WebAssembly Logo\u0022 width=\u0022150\u0022/\u003E\n\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EProgramming the Web has for a long time been limited to using \u003Ca href=\u0022https://en.wikipedia.org/wiki/JavaScript\u0022\u003EJavaScript\u003C/a\u003E. It is true that in the early...","Tags":["WebAssembly","Web"]},{"Title":"Specification","Slug":"specification-pattern-csharp-implementation","Author":null,"Image":null,"Published":"0001-01-01T00:00:00","Excerpt":"\u003Cp\u003E\u003Cem\u003EThe topic described in this article is a part of my \u003Ca href=\u0022http://test\u0022\u003ESpecification Pattern in C# Pluralsight\u003C/a\u003E course.\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003ESpecification pattern is not a new topic, there are many of its implementations on the Internet already. In this post, I’d like to discuss the use cases for the pattern and compare several common implementations to each other.\u003C/p\u003E\n\u003Ch2\u003E1. Specification pattern: what’s that?\u003C/h2\u003E\n\u003Cp\u003ESpecification pattern is a pattern that allows us to encapsulate some...","Tags":null}]