{"Name":null,"Posts":[{"Title":"Scaling a Monolith - without Microservices","Subtitle":null,"Slug":"scaling-a-monolith-without-microservices","Author":null,"Image":null,"Published":"2021-09-06T00:00:00","EstimatedReadTime":"00:03:42.7636363","Excerpt":"\u003Cp\u003EOne myth is that you need to \u0026quot;do\u0026quot; microservices in order to scale your service applications horizontally. This has prompted a lot of people to rewrite their existing monoliths into microservices.\u003C/p\u003E\n\u003Cp\u003EDon\u0027t get me wrong. There are benefits in microservices, but you need to understand the problems that the tools address before you start to use them - especially in an existing project. The cost of changing existing code might outrun the potential benefits in terms of the technical...","Tags":["Software engineering","Distributed applications"]},{"Title":"Docker and Kubernetes","Subtitle":"An Introduction","Slug":"docker-and-kubernetes-an-introduction","Author":null,"Image":"/assets/container-ship.jpeg","Published":"2021-09-01T00:00:00","EstimatedReadTime":"00:02:30.1090909","Excerpt":"\u003Cp\u003E\u003Cem\u003EUpdated on September 20th, 2021.\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003EThere are two pieces of software that everybody is talking about right now: Docker and Kubernetes.\u003C/p\u003E\n\u003Ch2\u003EDocker\u003C/h2\u003E\n\u003Cp\u003EDocker is a virtualization software that lets you build composable software parts, called \u0026quot;images\u0026quot;, that then run in isolated compartments: \u0026quot;containers\u0026quot;.\u003C/p\u003E\n\u003Cp\u003EImagine wanting a Web Server. Instead of manually installing and configuring Nginx (\u0026quot;Engine-X\u0026quot;) in a Virtual Machine, you just tell...","Tags":["Docker","Kubernetes","DevOps","Distributed applications"]},{"Title":"Microservices - What are they?","Subtitle":null,"Slug":"microservices-what-are-they","Author":null,"Image":null,"Published":"2021-09-01T00:00:00","EstimatedReadTime":"00:01:57.8181818","Excerpt":"\u003Cp\u003EMicroservices is a hot topic in software development nowadays. Everybody wants to do it, but what is the point of it?\u003C/p\u003E\n\u003Cp\u003EAnd the most important question: How small should a micro service really be?\u003C/p\u003E\n\u003Ch2\u003EWhat are Microservices?\u003C/h2\u003E\n\u003Cp\u003EMicroservices are a response to building traditional monolithic Service-oriented applications (SOA) - addressing the problems in scalability and fault tolerance in distributed software systems.\u003C/p\u003E\n\u003Cp\u003EIt used to be that developers built services that had...","Tags":["Microservices","Distributed applications"]},{"Title":"Introduction to .NET","Subtitle":null,"Slug":"introduction-to-dotnet","Author":"Marina Sundström","Image":null,"Published":"2021-04-25T00:00:00","EstimatedReadTime":"00:04:22.6909090","Excerpt":"\u003Cp\u003E.NET is an open-source platform for building applications for the Web, Mobile, Desktop, and Cloud. Currently, it is at version 5, which was released in November 2020.\u003C/p\u003E\n\u003Cp\u003E.NET provides a runtime environment, the Common Language Runtime (CLR), an extensive base Base Class Library (BCL), programming languages like C#, VB.NET, and F#. On top of the platform you find many application frameworks, such as ASP.NET Core and WPF. It also integrates well with Microsoft Azure.\u003C/p\u003E\n\u003Cp\u003EThe platform...","Tags":[".NET","C#"]},{"Title":"JavaScript interop in .NET on WebAssembly","Subtitle":null,"Slug":"js-interop-in-dotnet-wasm","Author":null,"Image":null,"Published":"2019-10-20T00:00:00","EstimatedReadTime":"00:05:47.5636363","Excerpt":"\u003Cblockquote\u003E\n\u003Cp\u003EThis article was written back in 2019-06-15.\u003C/p\u003E\n\u003C/blockquote\u003E\n\u003Cp\u003EThis article is about JavaScript interop in .NET on WebAssembly in the context of Blazor.\u003C/p\u003E\n\u003Cp\u003ESince WASM development, at least, is about the web we will assume that we can do some interop with the browser, like DOM manipulation. But how?\u003C/p\u003E\n\u003Ch2\u003EJavaScript interop in Blazor\u003C/h2\u003E\n\u003Cp\u003EIf you want to interop with JavaScript today, you are most likely writing a Blazor app.\u003C/p\u003E\n\u003Cp\u003EIn fact, Blazor on client-side...","Tags":[".NET","WebAssembly","WASM","JavaScript","Blazor"]}],"Page":2,"TotalPages":3}