{"Name":null,"Posts":[{"Title":"C# features that Java doesn\u0027t have","Subtitle":null,"Slug":"csharp-features-java-doesnt-have","Author":null,"Image":null,"Published":"2023-04-14T00:00:00","EstimatedReadTime":"00:21:58.0363636","Excerpt":"\u003Cp\u003EIn this article I list some of the major features in C# and .NET that have no direct equivalent in Java. Some of the features are just mentioned because they are so essential and cool.\u003C/p\u003E\n\u003Cp\u003EI explain how stuff works and also demonstrate some in C# code.\u003C/p\u003E\n\u003Cp\u003EMy goal has been to show some C# specific syntax without highlighting it, like expression-bodied methods and alternative syntax for initializing objects. You will also notice my alternating use of \u003Ccode\u003Evar\u003C/code\u003E for type...","Tags":[".NET","C#"]},{"Title":"My Programming Timeline","Subtitle":null,"Slug":"my-programming-timeline","Author":null,"Image":null,"Published":"2023-01-20T00:00:00","EstimatedReadTime":"00:04:37.0909090","Excerpt":"\u003Cp\u003EHere are some of the defining events and projects in my life and career as a programmer and software developer.\u003C/p\u003E\n\u003Cp\u003E\u003Cem\u003EThanks to \u003Ca href=\u0022https://aryanrahman3212.netlify.app/blog/27_1_2023_timeline\u0022\u003EAryan Rahman\u003C/a\u003E who did his timeline and inspired me to do my own.\u003C/em\u003E\u003C/p\u003E\n\u003Cp\u003E\u003Cstrong\u003E~1997\u003C/strong\u003E - Got introduced to computers by my dad. I started to draw in KidPix. MS Paint later became a favorite of mine. As well as playing games. Exploring different programs. This was before we even...","Tags":["Personal"]},{"Title":"Coder or Software Developer?","Subtitle":"What is the difference really?","Slug":"coder-or-software-developer","Author":null,"Image":null,"Published":"2023-01-19T00:00:00","EstimatedReadTime":"00:02:42.3272727","Excerpt":"\u003Cp\u003EI have been thinking about how I as someone who likes building software really identify myself.\u003C/p\u003E\n\u003Cp\u003EAm I a Software developer? - Is that what I refer to myself as, or just what my employer told me that I am?\u003C/p\u003E\n\u003Cp\u003EHow you refer to yourself does make a difference when promoting yourself in the industry and wider community. It also affects your self image, your confidence, and career opportunities.\u003C/p\u003E\n\u003Ch2\u003ETitle vs Role\u003C/h2\u003E\n\u003Cp\u003EThere is a somewhat clear distinction between a title held by...","Tags":["Software development","Programming"]},{"Title":"Analysis of an online marketplace","Subtitle":"How the lack of consumer merchant awareness bites back","Slug":"analysis-of-an-online-marketplace","Author":null,"Image":null,"Published":"2023-01-18T00:00:00","EstimatedReadTime":"00:04:23.7818181","Excerpt":"\u003Cp\u003E\u003Cem\u003EDisclaimer: This article does not deal with the politics of CDON as a company.\u003C/em\u003E\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EDuring my short tenure at \u003Ca href=\u0022https:///www.cdon.com/\u0022\u003ECDON\u003C/a\u003E, a Swedish online marketplace, I got experience with the site and how consumers might view both the site and brand. These are my observations of and thoughts about the product: the CDON Marketplace.\u003C/p\u003E\n\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EThe purpose with this article is analyzing the CDON Marketplace and to highlight what I believe could...","Tags":["Business analysis"]},{"Title":"The truth about my first employment","Subtitle":null,"Slug":"the-truth-about-my-first-employment","Author":null,"Image":null,"Published":"2023-01-17T00:00:00","EstimatedReadTime":"00:02:22.0363636","Excerpt":"\u003Cp\u003EMy first real job as a Software Developer was back in early 2014 to 2016 for a small-sized company that sold electronics, provided IT-services, as well as being an Internet Service Provider (ISP) - providing broadband and fiber to customers. My first assignment was \u003Ca href=\u0022/articles/building-software-for-emergency-response\u0022\u003Ebuilding an app for emergency response\u003C/a\u003E from ground up. It was the best time ever. I worked closely with the product owner who had all the technical knowledge, testing...","Tags":["Work experience"]}],"Page":1,"TotalPages":3}