{"Name":null,"Posts":[{"Title":"Uttrycka tillhörighet, innehav, och befintlighet i hebreiska","Subtitle":null,"Slug":"uttrycka-tillhorighet-i-hebreiska","Author":null,"Image":null,"Published":"2025-04-21T00:00:00","EstimatedReadTime":"00:06:36.3090909","Excerpt":"\u003Ch2\u003EInledning\u003C/h2\u003E\n\u003Cp\u003EHebreiskan är ett semitiskt språk med djupa band till det judiska folket – dess religion, kultur och historia. Under nästan två tusen år var språket i stort sett utdött som vardagligt tal; det användes främst i religiösa sammanhang och av lärda judiska tänkare, men inte som modersmål. Trots det har hebreiskan genomgått stora förändringar.\u003C/p\u003E\n\u003Cp\u003EMed sionismens framväxt och den moderna staten Israels grundande återfick hebreiskan sin roll som levande språk. Den utvecklades...","Tags":["Languages","Hebrew","på svenska","hebreiska"]},{"Title":"What is new in C# 12","Subtitle":null,"Slug":"what-is-new-in-csharp-12","Author":null,"Image":null,"Published":"2023-11-13T00:00:00","EstimatedReadTime":"00:04:18.5454545","Excerpt":"\u003Cp\u003EWith the advent of .NET 8 (on November 14, 2023), and .NET Conf soon to take place, let\u0027s us see what the next version of C# (12) will bring to developers.\u003C/p\u003E\n\u003Cp\u003EC# 12 is a fairly minor update to the programming language. And I have picked out the features that I think are worth mentioning.\u003C/p\u003E\n\u003Cp\u003EOne of the features have been previewed many years ago, and been long-awaited.\u003C/p\u003E\n\u003Cp\u003EA full list of all new language features can be found \u003Ca...","Tags":["C#",".NET","Programming languages"]},{"Title":"Generics in Java vs .NET","Subtitle":"A .NET developer\u0027s perspective","Slug":"generics-in-java-vs-dotnet","Author":null,"Image":null,"Published":"2023-11-11T00:00:00","EstimatedReadTime":"00:17:07.6363636","Excerpt":"\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EI\u0027m a .NET developer, writing C# code. But 9 months ago, I joined a company whose code is almost exclusively Java. As I have gotten more into writing Java code, I have become more aware of the differences between Java and my beloved C#.\u003C/p\u003E\n\u003Cp\u003EBoth Java and C# are at their core general-purpose object-oriented programming languages, with similar syntaxes, but there are some fundamental differences that are not apparent until you dig deeper. In particular, when coming to how...","Tags":["C#",".NET","Java","Generics","Programming languages"]},{"Title":"Building distributed apps in .NET with MassTransit","Subtitle":null,"Slug":"building-distributed-apps-with-masstransit","Author":null,"Image":null,"Published":"2023-11-10T00:00:00","EstimatedReadTime":"00:13:06.9818181","Excerpt":"\u003Ch2\u003EIntroduction\u003C/h2\u003E\n\u003Cp\u003ESo many apps that are being built today are part of distributed systems made up of two or more services that communicate with each other. They do so by sending messages, or publishing events. They are so called \u0026quot;Event-driven architectures\u0026quot;.\u003C/p\u003E\n\u003Cp\u003ELearning everything that enables this, the technologies and the patterns, might be cumbersome, in particular if you don\u0027t know where to start.\u003C/p\u003E\n\u003Cp\u003EThe goal of this article is to give you a starting point from which...","Tags":["C#",".NET","Distributed apps","Microservices","MassTransit","RabbitMQ"]},{"Title":"Exploring dependency injection in .NET","Subtitle":null,"Slug":"exploring-dependency-injection-in-dotnet","Author":null,"Image":null,"Published":"2023-11-09T00:00:00","EstimatedReadTime":"00:06:40.3636363","Excerpt":"\u003Cp\u003EMicrosoft provides a nifty set of dependency injection framework abstractions, as well as a default service container (IoC) implementation. Because of this architecture, it does however allow you to plug in your favorite dependency framework, like Autofac.\u003C/p\u003E\n\u003Cp\u003EWe will cover the \u003Ccode\u003EServiceCollection\u003C/code\u003E, \u003Ccode\u003EServiceProvider\u003C/code\u003E, service lifetimes, and scopes.\u003C/p\u003E\n\u003Cp\u003EFor the code to run in a Console application, you need to add a package reference:\u003C/p\u003E\n\u003Cpre\u003E\u003Ccode...","Tags":["C#",".NET"]}],"Page":1,"TotalPages":5}