{"Name":null,"Posts":[{"Title":"Coder or Software Developer?","Subtitle":"What is the difference really?","Slug":"coder-or-software-developer","Author":null,"Image":null,"Published":"2023-01-19T00:00:00","EstimatedReadTime":"00:02:42.3272727","Excerpt":"\u003Cp\u003EI have been thinking about how I as someone who likes building software really identify myself.\u003C/p\u003E\n\u003Cp\u003EAm I a Software developer? - Is that what I refer to myself as, or just what my employer told me that I am?\u003C/p\u003E\n\u003Cp\u003EHow you refer to yourself does make a difference when promoting yourself in the industry and wider community. It also affects your self image, your confidence, and career opportunities.\u003C/p\u003E\n\u003Ch2\u003ETitle vs Role\u003C/h2\u003E\n\u003Cp\u003EThere is a somewhat clear distinction between a title held by...","Tags":["Software development","Programming"]},{"Title":"Analysis of an online marketplace","Subtitle":"How the lack of consumer merchant awareness bites back","Slug":"analysis-of-an-online-marketplace","Author":null,"Image":null,"Published":"2023-01-18T00:00:00","EstimatedReadTime":"00:04:23.7818181","Excerpt":"\u003Cp\u003E\u003Cem\u003EDisclaimer: This article does not deal with the politics of CDON as a company.\u003C/em\u003E\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EDuring my short tenure at \u003Ca href=\u0022https:///www.cdon.com/\u0022\u003ECDON\u003C/a\u003E, a Swedish online marketplace, I got experience with the site and how consumers might view both the site and brand. These are my observations of and thoughts about the product: the CDON Marketplace.\u003C/p\u003E\n\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EThe purpose with this article is analyzing the CDON Marketplace and to highlight what I believe could...","Tags":["Business analysis"]},{"Title":"The truth about my first employment","Subtitle":null,"Slug":"the-truth-about-my-first-employment","Author":null,"Image":null,"Published":"2023-01-17T00:00:00","EstimatedReadTime":"00:02:22.0363636","Excerpt":"\u003Cp\u003EMy first real job as a Software Developer was back in early 2014 to 2016 for a small-sized company that sold electronics, provided IT-services, as well as being an Internet Service Provider (ISP) - providing broadband and fiber to customers. My first assignment was \u003Ca href=\u0022/articles/building-software-for-emergency-response\u0022\u003Ebuilding an app for emergency response\u003C/a\u003E from ground up. It was the best time ever. I worked closely with the product owner who had all the technical knowledge, testing...","Tags":["Work experience"]},{"Title":"Building software for emergency response","Subtitle":"How my software career started","Slug":"building-software-for-emergency-response","Author":null,"Image":null,"Published":"2022-10-06T00:00:00","EstimatedReadTime":"00:03:05.2363636","Excerpt":"\u003Cp\u003EI started my career back in 2014, as a part-time employee doing a project at the radio comm department at a small IT company in a small town in southern Skåne, Sweden. The company had developed a platform primarily for helping first responders (police, ambulance, firefighters). It consisted of the company\u0027s custom-made automation hardware which integrated with other technologies. Now they wanted a Windows application to allow for customers to interface with it and take advantage of all the...","Tags":["Work experience"]},{"Title":"Project Highlight: Access Control","Subtitle":null,"Slug":"access-control","Author":null,"Image":"/assets/accesscontrol.jpg","Published":"2021-11-16T00:00:00","EstimatedReadTime":"00:02:53.8909090","Excerpt":"\u003Cp\u003EThis is a short presentation about one of my dearest personal projects. The projects combines my passion for programming with my interest in software design - and my desire to learn.\u003C/p\u003E\n\u003Cp\u003EMy main goal in this project was to learn more about building distributed applications - with some IoT. I also wanted to learn more about Microsoft Azure.\u003C/p\u003E\n\u003Chr /\u003E\n\u003Cp\u003EBack in 2017, I was looking for some fun project to do in my spare time - but I needed a cool use case.\u003C/p\u003E\n\u003Cp\u003ESince I was working as a...","Tags":["Projects",".NET","Web","Distributed applications"]}],"Page":2,"TotalPages":4}