{"Name":"C#","Posts":[{"Title":"Generics in Java vs .NET","Subtitle":"A .NET developer\u0027s perspective","Slug":"generics-in-java-vs-dotnet","Author":null,"Image":null,"Published":"2023-11-11T00:00:00","EstimatedReadTime":"00:14:52.3636363","Excerpt":"\u003Ch2\u003EBackground\u003C/h2\u003E\n\u003Cp\u003EI\u0027m a .NET developer, writing C# code. But 9 months ago, I joined a company whose code is almost exclusively Java. As I have gotten more into writing Java code, I have become more aware of the differences between Java and my beloved C#.\u003C/p\u003E\n\u003Cp\u003EBoth Java and C# are at their core general-purpose object-oriented programming languages, with similar syntaxes, but there are some fundamental differences that are not apparent until you dig deeper. In particular, when coming to how...","Tags":["C#",".NET","Java","Generics","Programming languages"]},{"Title":"Building distributed apps in .NET with MassTransit","Subtitle":null,"Slug":"building-distributed-apps-with-masstransit","Author":null,"Image":null,"Published":"2023-11-10T00:00:00","EstimatedReadTime":"00:13:22.9090909","Excerpt":"\u003Ch2\u003EIntroduction\u003C/h2\u003E\n\u003Cp\u003ESo many apps that are being built today are part of distributed systems made up of two or more services that communicate with each other. They do so by sending messages, or publishing events. They are so called \u0026quot;Event-driven architectures\u0026quot;.\u003C/p\u003E\n\u003Cp\u003ELearning everything that enables this, the technologies and the patterns, might be cumbersome, in particular if you don\u0027t know where to start.\u003C/p\u003E\n\u003Cp\u003EThe goal of this article is to give you a starting point from which...","Tags":["C#",".NET","Distributed apps","Microservices","MassTransit","RabbitMQ"]},{"Title":"Exploring dependency injection in .NET","Subtitle":null,"Slug":"exploring-dependency-injection-in-dotnet","Author":null,"Image":null,"Published":"2023-11-09T00:00:00","EstimatedReadTime":"00:05:59.3454545","Excerpt":"\u003Cp\u003EMicrosoft provides a nifty set of dependency injection framework abstractions, as well as a default service container (IoC) implementation. Because of this architecture, it does however allow you to plug in your favorite dependency framework, like Autofac.\u003C/p\u003E\n\u003Cp\u003EWe will cover the \u003Ccode\u003EServiceCollection\u003C/code\u003E, \u003Ccode\u003EServiceProvider\u003C/code\u003E, service lifetimes, and scopes.\u003C/p\u003E\n\u003Cp\u003EFor the code to run in a Console application, you need to add a package reference:\u003C/p\u003E\n\u003Cpre\u003E\u003Ccode...","Tags":["C#",".NET"]},{"Title":"C# features that Java doesn\u0027t have","Subtitle":null,"Slug":"csharp-features-java-doesnt-have","Author":null,"Image":null,"Published":"2023-04-14T00:00:00","EstimatedReadTime":"00:23:17.6727272","Excerpt":"\u003Cp\u003EIn this article I list some of the major features in C# and .NET that have no direct equivalent in Java. Some of the features are just mentioned because they are so essential and cool.\u003C/p\u003E\n\u003Cp\u003EI explain how stuff works and also demonstrate some in C# code.\u003C/p\u003E\n\u003Cp\u003EMy goal has been to show some C# specific syntax without highlighting it, like expression-bodied methods and alternative syntax for initializing objects. You will also notice my alternating use of \u003Ccode\u003Evar\u003C/code\u003E for type...","Tags":[".NET","C#"]},{"Title":"Introduction to .NET","Subtitle":null,"Slug":"introduction-to-dotnet","Author":"Marina Sundström","Image":null,"Published":"2021-04-25T00:00:00","EstimatedReadTime":"00:04:22.6909090","Excerpt":"\u003Cp\u003E.NET is an open-source platform for building applications for the Web, Mobile, Desktop, and Cloud. Currently, it is at version 5, which was released in November 2020.\u003C/p\u003E\n\u003Cp\u003E.NET provides a runtime environment, the Common Language Runtime (CLR), an extensive base Base Class Library (BCL), programming languages like C#, VB.NET, and F#. On top of the platform you find many application frameworks, such as ASP.NET Core and WPF. It also integrates well with Microsoft Azure.\u003C/p\u003E\n\u003Cp\u003EThe platform...","Tags":[".NET","C#"]}],"Page":1,"TotalPages":1}